nnd4yyds/ai_voice_assistant/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Partition table for ESP-SR with model partition
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_sr.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_sr.csv"
CONFIG_PARTITION_TABLE_NAME="Custom partition table for SR"

# SPIFFS config for SR models
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y

# SR Model partition
CONFIG_SPIFFS_PARTITION_LABEL="model"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# SPIFFS config for SR models
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y

# FreeRTOS config
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Main task stack size
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3584
